{
  "title": "The Heart of Practice",
  "summary": "Buddhist practice notes and teachings - buddhism-books-being-peace",
  "createdDate": "2025-12-11T18:28:30Z",
  "updatedDate": "2025-12-11T18:28:30Z",
  "hashtags": ["#buddhism", "#pre-website", "#buddhism-books-being-peace"],
  "status": "active",
  "thoughts": [
    {
      "id": "thought-buddhism-001",
      "date": "2025-12-11T18:28:30Z",
      "content": "# The Heart of Practice\n\nThe paper of the book contains a piece of everything in existence. It is a reflection of the entire cosmos. \n\nThis idea holds true for the individual and their relationship to society. One person contains a piece of all of society and when we seek peace through meditation we are actually achieving a bit of the peace for society as well.\n\nJust as each individual leaf nourishes the whole tree so do individual humans nourish the whole of society. One cannot help society as an entity separates from it because one cannot be separate from it in fact.\n\nMeditation is not to be removed from society but to return and nourish it ❤️‍🩹\n\n*******\n\n1. We are meditating to clean up our side of the street in order to improve the whole world not just ourselves. What good is inner peace in a world where you can’t enjoy it.\n2. Sharing the practice of meditation is the entire point. The sangha is the third gem for a reason. Share meditation with your friends and family so they may too clean their side of the street and make the world a better place one mind at a time.\n\n*******\n\nRemaining connected to society is the only way to fix it. This is why we practice meditation.\n\n*******\n\nRefuge in society is the only one we really have when all else fails. We cannot hide from society because we inter-are society.\n\n*******\n\nPracticing Buddhism in the little everyday moments is the idea of engaged Buddhism. One should practice smiling, breathing, and being mindful in all one’s activities.\n\n*******\n\nWe can use Gathas to focus our mind and extend our practice to the non-practice times.\n\n*******\n\nMrs. Nguyen’s name calling parable. Practice for quality over quantity. Deep, abiding practice will have lasting effects in your life. The idea of a 90 in 90 is to develop a deeper involvement in the fellowship not to trudge through the 90 meetings like a chore to be accomplished. This is why I have put no time limit on my one meeting a day goal -  until it feels right to stop. I am practicing not attaching to a goal or set end.\n\n*******\n",
      "hashtags": ["#buddhism", "#buddhism-books-being-peace"]
    }
  ],
  "changelog": [
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "created",
      "description": "Imported from Notion export - pre-website content"
    },
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "thought_added",
      "description": "Added Buddhist teaching notes",
      "thoughtId": "thought-buddhism-001"
    }
  ]
}
