{
  "title": "Feelings and Perceptions",
  "summary": "Buddhist practice notes and teachings - buddhism-books-being-peace",
  "createdDate": "2025-12-11T18:28:30Z",
  "updatedDate": "2025-12-11T18:28:30Z",
  "hashtags": ["#buddhism", "#pre-website", "#buddhism-books-being-peace"],
  "status": "active",
  "thoughts": [
    {
      "id": "thought-buddhism-001",
      "date": "2025-12-11T18:28:30Z",
      "content": "# Feelings and Perceptions\n\nEmotional states depend of perspectives which are in turn dependent on previous causes and conditions. With meditation we learn to change our perspective with awareness of our present conditions.\n\n*******\n\nThings are often not quite what they seem and this tends to provoke emotions that are inappropriate once all the correct information is gleaned from the situation. Buddhism teaches us to slow down and be truly aware before allowing a reaction to form - if we form one at all.\n\n*******\n\nLike the circus act of daughter and father, we must care for ourselves as a way of caring for others. Keeping our side of the street clean is a way of showing compassion toward the outside world.\n\nIn order to understand something or someone you just be one with them. Become empty and allow it/them to fill you.\n\nNon-duality means that the observer and the observed are the one and same and cannot be separated like the observer and the particle in the two-slit experiment. They are a part of a bigger - “meta” - whole that is not divisible and thus must be observed as one entity that is interacting within it self all the time. The Buddhist uses this idea when meditating where mind and body inter-are.\n\n*******\n\nEmotional states are a part of us and we not should strive to remove them. Through meditation we learn to sit IN these emotions and explore them. To truly understand their sources and causes and eventually to convert their energies into beneficial ones. Anger into understanding for example. Avoiding or severing emotions from us is a violence against ourselves.\n\n*******\n\n“Knowing” without open-mindedness is a stumbling block to understanding. If you grasp your knowledge too tight, even if the truth knocks on the door, you will not open it.\n",
      "hashtags": ["#buddhism", "#buddhism-books-being-peace"]
    }
  ],
  "changelog": [
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "created",
      "description": "Imported from Notion export - pre-website content"
    },
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "thought_added",
      "description": "Added Buddhist teaching notes",
      "thoughtId": "thought-buddhism-001"
    }
  ]
}
