{
  "title": "Tiep Hien  and the 14 Precepts",
  "summary": "Buddhist practice notes and teachings - buddhism-books-being-peace",
  "createdDate": "2025-12-11T18:28:30Z",
  "updatedDate": "2025-12-11T18:28:30Z",
  "hashtags": ["#buddhism", "#pre-website", "#buddhism-books-being-peace"],
  "status": "active",
  "thoughts": [
    {
      "id": "thought-buddhism-001",
      "date": "2025-12-11T18:28:30Z",
      "content": "# Tiep Hien  and the 14 Precepts\n\n[Order of Interbeing | Tiep Hien](https://orderofinterbeing.org/)\n\nThe Order of Interbeing \n\nOne must practice this way of life for a full year before taking the oath and starting one's own Extended Community.\n\nThe Core Community are People who have taken the vow the follow the 14 precepts of the Order.\n\n1. Practice at least 60 days of retreat/days of mindfulness a year\n2. Celibacy or a family life\n3. At least once every two weeks, members come together and recite the 14 precepts\n    a. They begin with the three refuges and the two promises\n    b. Promise 1: “I vow to develop my compassion in in order to love and protect the life people, animals, and plants.”\n    c. Promise 2: “I vow to develop understanding in or\n    d. The promises are compassion and understanding - the essence of Buddha’s teachings\n    e. These first recitations are done by all including the children and then the adults recite the 14 precepts.\n\n# The 14 Precepts\n\n1. First: Do not be idolatrous about or bound to any doctrine, theory, or ideology, even Buddhist ones. All systems of thought are guiding means; they are not absolute truths.\n    a. We must not allow dogmatism to lead us astray or bring violence to our hearts.\n2. Second: Do not think that the knowledge you currently possess is changeless, absolute truth. Avoid being narrow-minded and bound to present views. Learn and practice non-attachment from view sun order to be open to receive others’ viewpoints. Truth is found in life not merely in conceptual knowledge. Be ready to learn throughout your entire life and to observe reality in yourself and in the world at all times.\n    a. I must not be married to any one way of seeing the world so I don’t miss the truth when it is in front of my face. This a bird vs frog question. If I am too siloed in one way of thinking I will not see the wisdom right next door.\n3. Third: Do not force others, including children, by any means whatsoever, to adopt your views, whether by authority, threat, money, propaganda, or even education. However, through compassionate dialogue, help other renounce fanaticism and narrowness.\n    a. Do not proselytize but spread wisdom through compassionate dialogue. When the teacher is ready the student will arrive.\n4. Fourth: Do not avoid contact with suffering or close your eyes to suffering. Do not lose awareness of the existence of suffering in the life of the world. Find ways to be with those are suffering by all means, including personal contact and visits, images, sound. By such means, awaken yourself and others to the reality of suffering in the world.\n    a. It is only by bearing witness to the deep suffering in the world that we can foster the compassion requires to look for remedies to such suffering and walk the path to enlightenment.\n5. Fifth: Do not accumulate wealth while millions are hungry. Do not take as the aim of your life fane, profit, wealth, or sensual pleasure. Live simply and share time, energy, and material resources with those who are in need.\n    a. I have to learn to let go of the drive for wealth and power. I must dedicate my motivation to the betterment of others’ lives. While there is suffering, it is mine.\n6. Sixth: Do not maintain anger or hatred. As soon as anger and hatred arise, practice the meditation on compassion in order to deeply understand the persons who have caused anger\n    a. “compassionate eyes looking living beings” it is impossible to have compassion and anger towards someone at the same time; I just choose one\n7. Seventh: Do not lose yourself in dispersion and in your surroundings. Learn to practice breathing in order to regain composure of body and mind, to practice mindfulness, and to develop concentration and understanding.\n    a. Conscious contact with my mindfulness is the pole on which I must balance my life\n8. Eighth: Do not utter words that can create discord and cause the community to break. Make every effort to reconcile and resolve all conflicts, however small.\n    a. I just not talk shit behind people’s backs that will cause disharmony. This is the first tradition. Personal recovery depends on NA unity.\n9. Ninth: Do not say untruthful things for the sake of personal interest or to impress people. Do not utter words that cause division and hatred. Do not spread news that you do not know to be certain. Do not criticize or condemn things that you are not sure of. Always speak truthfully and constructively. Have the courage to speak out about situations of injustice, even when doing so may threaten your own safety.\n    a. Be mindful of the creative power of your tongue. Speak peace into the world with truth and compassion and mind that you don’t create harm recklessly.\n10. Tenth: Do not use the Buddhist community for personal gain or profit, or transform your community into a political party. A religious community should, however, take a clear stand against oppression and injustice, and should strive to change the situation without engaging in partisan conflicts.\n    a. Buddhism should never be a weapon of power or a profit engine. I must be mindful that I use Buddhism only to benefit the world and not myself alone\n11. Eleventh: Do not live with a vocation that is harmful to humans and nature. Do not invest in companies that deprive others of their chance to life. Select a vocation which helps t your ideal of compassion.\n    a. Compassion like happiness is a direction not a destination. We should be doing things with our daily lives that point our existence towards the North Star of compassion and loving kindness at all times while still recalling that we will fall short at times.\n12. Twelfth: Do not kill. Do not let others kill. Find whatever means possible to protect life and prevent war.\n    a. This means working to affect less war and reducing the national time and money spent on wars and war machines. Insert Eisenhower quote.\n13. Thirteenth: Possess nothing that should belong to others. Respect the property of others but prevent others from enriching themselves from human suffering or the suffering of other beings.\n    a. Work to prevent the commercialization of harm and harmful vocations. Profit at the expense of others is unacceptable.\n14. Fourteenth: Do not mistreat your body. Learn to handle it with respect. Do not look on your body only as an instrument. Preserve vital energies (sexual, breath, spirit) for the realization of the Way. Sexual should not happen without love and commitment. In sexual relationships, be aware of future suffering that may be caused. To preserve happiness of others, respect the rights and commitments of others. Be fully aware of the responsibility of bringing new lives into the world. Meditate on the world into which you are bringing new beings.\n    a. Be mindful that to be born is to suffer and procreate accordingly\n",
      "hashtags": ["#buddhism", "#buddhism-books-being-peace"]
    }
  ],
  "changelog": [
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "created",
      "description": "Imported from Notion export - pre-website content"
    },
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "thought_added",
      "description": "Added Buddhist teaching notes",
      "thoughtId": "thought-buddhism-001"
    }
  ]
}
