{
  "title": "Working for Peace",
  "summary": "Buddhist practice notes and teachings - buddhism-books-being-peace",
  "createdDate": "2025-12-11T18:28:30Z",
  "updatedDate": "2025-12-11T18:28:30Z",
  "hashtags": ["#buddhism", "#pre-website", "#buddhism-books-being-peace"],
  "status": "active",
  "thoughts": [
    {
      "id": "thought-buddhism-001",
      "date": "2025-12-11T18:28:30Z",
      "content": "# Working for Peace\n\nCompassion is required because we inter-are both both the sea pirate and the\nrape victim who who drowns herself in the sea. The communist and capitalist. The\nconservative and progressive. We are all the products our society produces. We\nare all one and the same and must act as us. And take responsibility and\ncompassion for for all sentient beings.\n\n---\n\nYou have to be woke to save the world. Being aware is the Buddhist version of\nbeing woke. Everything we consume has global consequences and those with the\nmost power must have the greatest responsibility to make positive changes.\n\n---\n\nKnow where you are going before you leave, as to not waste your valuable time.\n\n> We should be aware. The most basic precept of all is to be aware of what we\n> do, what we are, each minute. Every other precept will follow from that.\n\n---\n\nA non-dualist mindset requires viewing everything as one and nothing is\nseparable enough to be juxtaposed against our beings. It means to inter-be.\nIndivisible. Whole. Of a piece.\n\n---\n\nPeace can only be achieved through mediation by a truly empathetic person. Being\nunable to see that we are truly the same being - we inter-are - means that we\nwill not being able to bring about peace. We are all mothers and children; we\nmust remember that when we think of our “enemies” as much as when we think of\nthose close to us.\n\n---\n\n### 7 Practices of Reconciliation\n\n1. Face-to-face sitting\n   - Attempting to reach a meditative calm while sitting in front of the other in conflict is a tough feat indeed.\n2. Remembrance\n   - Trying to recall all the details of the day/event and see the differences between the stories as told from different perspectives.\n3. Non-stubbornness\n   - Just like Scanlon’s contractualism, this process requires honest and willing participants to come to the table with an honest desire to reach a resolution.\n4. Covering Mud with Straw\n   - Loving advocates for both sides of the disagreement speak kind and loving words on each behalf.\n5. Voluntary confession\n   - Starting small, each party admits to small transgressions in order to prime the resolution pump for higher levels of acceptance.\n6. Decision by consensus\n   - The entire group/sangha uses consensus decision making to determine the outcome of the dispute.\n7. Accepting the verdict\n   - Once decided by consensus, the decision is final and must be respected by all parties for the sake of the sangha’s unity. You can’t win all battles.\n\n---\n\nWe have to be the peace we want to see in the world. Treat others like peaceful\nbeings and eventually they will become one.\n",
      "hashtags": ["#buddhism", "#buddhism-books-being-peace"]
    }
  ],
  "changelog": [
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "created",
      "description": "Imported from Notion export - pre-website content"
    },
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "thought_added",
      "description": "Added Buddhist teaching notes",
      "thoughtId": "thought-buddhism-001"
    }
  ]
}
