{
  "title": "Sutra of the Three Heaps",
  "summary": "Buddhist practice notes and teachings - notes-and-contemplations",
  "createdDate": "2025-12-11T18:28:30Z",
  "updatedDate": "2025-12-11T18:28:30Z",
  "hashtags": ["#buddhism", "#pre-website", "#notes-and-contemplations"],
  "status": "active",
  "thoughts": [
    {
      "id": "thought-buddhism-001",
      "date": "2025-12-11T18:28:30Z",
      "content": "# Sutra of the Three Heaps\n\n[The Sutra of the Three Heaps](https://thubtenchodron.org/2011/06/visualization-thirty-five-buddhas/)\n\n- The Bodhisattva’s Confession of Ethical Downfalls\n\n\n- Prostrate and beseech wisdom from the Buddhas and admit wrongdoing with this prayer:\n- Continue to prostrate while reciting the names of the Buddhas and the confession prayer.\n\nI, (say your name) throughout all times, [take refuge](https://thubtenchodron.org/glossary/take-refuge/) in the [Gurus](https://thubtenchodron.org/glossary/lama/); I [take refuge](https://thubtenchodron.org/glossary/take-refuge/) in the Buddhas; I [take refuge](https://thubtenchodron.org/glossary/take-refuge/) in the Dharma; I [take refuge](https://thubtenchodron.org/glossary/take-refuge/) in the [Sangha](https://thubtenchodron.org/glossary/sangha/).\n\nTo the Founder, the Transcendent Destroyer, the One Thus Gone.[1](https://thubtenchodron.org/2011/06/visualization-thirty-five-buddhas/#fn1-22482) the Foe Destroyer, the Fully Awakened One, the Glorious Conqueror from the Shakyas I bow down.\n\nTo the One Thus Gone, the Great Destroyer, Destroying with Vajra Essence, I bow down.\n\nTo the One Thus Gone, the Jewel Radiating Light, I bow down.\n\nTo the One Thus Gone, the King with Power over the Nagas, I bow down.\n\nTo the One Thus Gone, the Leader of the Warriors, I bow down.\n\nTo the One Thus Gone, the Glorious Blissful One, I bow down.\n\nTo the One Thus Gone, the Jewel Fire, I bow down.\n\nTo the One Thus Gone, the Jewel Moonlight I bow down.\n\nTo the One Thus Gone, Whose Pure Vision Brings Accomplishments I bow down.\n\nTo the One Thus Gone, the Jewel Moon, I bow down.\n\nTo the One Thus Gone, the Stainless One, I bow down.\n\nTo the One Thus Gone, the Glorious Giver, I bow down.\n\nTo the One Thus Gone, the Pure One, I bow down.\n\nTo the One Thus Gone, the Bestower of Purity, I bow down.\n\nTo the One Thus Gone, the Celestial Waters, I bow down.\n\nTo the One Thus Gone, the Deity of the Celestial Waters, I bow down.\n\nTo the One Thus Gone, the Glorious Good, I bow down.\n\nTo the One Thus Gone, the Glorious Sandalwood, I bow down.\n\nTo the One Thus Gone, the One of Unlimited Splendor, I bow down.\n\nTo the One Thus Gone, the Glorious Light, I bow down.\n\nTo the One Thus Gone, the Glorious One without Sorrow, I bow down.\n\nTo the One Thus Gone, the Son of the Desireless One, I bow down.\n\nTo the One Thus Gone, the Glorious Flower, I bow down.\n\nTo the One Thus Gone, Who Understands Reality Enjoying the Radiant Light of Purity, I bow down.\n\nTo the One Thus Gone, Who Understands Reality Enjoying the Radiant Light of the Lotus, I bow down.\n\nTo the One Thus Gone, the Glorious Gem, I bow down.\n\nTo the One Thus Gone, the Glorious One who is Mindful, I bow down.\n\nTo the One Thus Gone, the Glorious One whose Name is Extremely Renowned, I bow down.\n\nTo the One Thus Gone, the King Holding the Banner of Victory over the Senses, I bow down.\n\nTo the One Thus Gone, the Glorious One who Subdues Everything Completely, I bow down.\n\nTo the One Thus Gone, the Victorious One in All Battles, I bow down.\n\nTo the One Thus Gone, the Glorious One Gone to Perfect Self-control, I bow down.\n\nTo the One Thus Gone, the Glorious One who Enhances and Illuminates Completely, I bow down.\n\nTo the One Thus Gone, the Jewel Lotus who Subdues All, I bow down.\n\nTo the One Thus Gone, the Foe Destroyer, the Fully Awakened One, the King with Power over [Mount Meru](https://thubtenchodron.org/glossary/mount-meru/), always remaining in the Jewel and the Lotus, I bow down.\n\n(Optional: If you wish to bow to the seven Medicine Buddhas)\n\nTo the [Buddha](https://thubtenchodron.org/glossary/buddha/), Renowned Glorious King of Excellent Signs, I bow down.\n\nTo the [Buddha](https://thubtenchodron.org/glossary/buddha/), King of Melodious Sound, I bow down.\n\nTo the [Buddha](https://thubtenchodron.org/glossary/buddha/), Stainless Excellent Gold, I bow down.\n\nTo the [Buddha](https://thubtenchodron.org/glossary/buddha/), Supreme Glory Free From Sorrow, I bow down.\n\nTo the [Buddha](https://thubtenchodron.org/glossary/buddha/), Melodious Ocean of Renowned Dharma, I bow down.\n\nTo the [Buddha](https://thubtenchodron.org/glossary/buddha/), Delightful King of Clear Knowing, I bow down.\n\nTo the Medicine [Buddha](https://thubtenchodron.org/glossary/buddha/), King of Lapis Light, I bow down.\n\nAll you 35 Buddhas, and all the others, those thus gone, foe destroyers, fully awakened ones and transcendent destroyers who are existing, sustaining and living throughout the ten directions of sentient beings’ worlds—all you Buddhas, please give me your attention.\n\nIn this life, and throughout beginningless lives in all the realms of samsara, I have created, caused others to create, and rejoiced at the creation of destructive karmas such as misusing [offerings](https://thubtenchodron.org/glossary/offering/) to holy objects, misusing [offerings](https://thubtenchodron.org/glossary/offering/) to the [Sangha](https://thubtenchodron.org/glossary/sangha/), stealing the possessions of the [Sangha](https://thubtenchodron.org/glossary/sangha/) of the ten directions; I have caused others to create these destructive actions and rejoiced at their creation.\n\nI have created the five heinous actions,[2](https://thubtenchodron.org/2011/06/visualization-thirty-five-buddhas/#fn2-22482) caused others to create them and rejoiced at their creation. I have committed the ten non-virtuous actions,[3](https://thubtenchodron.org/2011/06/visualization-thirty-five-buddhas/#fn3-22482) involved others in them, and rejoiced in their involvement.\n\nBeing obscured by all this [karma](https://thubtenchodron.org/glossary/karma/), I have created the cause for myself and other sentient beings to be reborn in the hells, as animals, as hungry ghosts, in irreligious places, amongst barbarians, as long-lived gods, with imperfect senses, holding [wrong views](https://thubtenchodron.org/glossary/wrong-views/), and being displeased with the presence of a [Buddha](https://thubtenchodron.org/glossary/buddha/).\n\nNow before these Buddhas, transcendent destroyers who have become transcendental wisdom, who have become the compassionate eye, who have become witnesses, who have become valid and see with their omniscient minds, I am confessing and accepting all these actions as destructive. I will not conceal or hide them, and from now on, I will refrain from committing these destructive actions.\n\nBuddhas and transcendent destroyers, please give me your attention: in this life and throughout beginningless lives in all the realms of samsara, whatever root of virtue I have created through even the smallest acts of charity such as giving one mouthful of food to a being born as an animal, whatever root of virtue I have created by keeping pure ethical conduct, whatever root of virtue I have created by abiding in pure conduct, whatever root of virtue I have created by fully ripening sentient beings’ minds, whatever root of virtue I have created by generating [bodhicitta](https://thubtenchodron.org/glossary/bodhicitta/), whatever root of virtue I have created of the highest transcendental wisdom.\n\nBringing together all these merits of both myself and others, I now dedicate them to the highest of which there is no higher, to that even above the highest, to the highest of the high, to the higher of the high. Thus I dedicate them completely to the highest, fully accomplished awakening.\n\nJust as the Buddhas and transcendent destroyers of the past have dedicated, just as the Buddhas and transcendent destroyers of the future will dedicate, and just as the Buddhas and transcendent destroyers of the present are dedicating, in the same way I make this dedication.\n\nI confess all my destructive actions separately and rejoice in all merits. I implore all the Buddhas to grant my request that I may realize the ultimate, sublime, highest transcendental wisdom.\n\nTo the sublime kings of the human beings living now, to those of the past, and to those who have yet to appear, to all those whose knowledge is as vast as an infinite ocean, I [go for refuge](https://thubtenchodron.org/glossary/take-refuge/).\n",
      "hashtags": ["#buddhism", "#notes-and-contemplations"]
    }
  ],
  "changelog": [
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "created",
      "description": "Imported from Notion export - pre-website content"
    },
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "thought_added",
      "description": "Added Buddhist teaching notes",
      "thoughtId": "thought-buddhism-001"
    }
  ]
}
