{
  "title": "The Four Immeasurables",
  "summary": "Buddhist practice notes and teachings - notes-and-contemplations",
  "createdDate": "2025-12-11T18:28:30Z",
  "updatedDate": "2025-12-11T18:28:30Z",
  "hashtags": ["#buddhism", "#pre-website", "#notes-and-contemplations"],
  "status": "active",
  "thoughts": [
    {
      "id": "thought-buddhism-001",
      "date": "2025-12-11T18:28:30Z",
      "content": "# The Four Immeasurables\n\n- Brahmaviharas, Four Boundless Qualities\n- each pairs with a strengthening practice\n- Shamata and Vipassana help us to see reality\n- the Four help us feel our interconnected reality - our tangible inter-subjectivity - “The Big Pond”\n- each also has a “neat and far enemy”\n\n\n- By definition, any of the Boundless Qualities and its Far Enemy can’t co-exist in our minds. They’re opposites.\n- **For any of the Four Boundless Qualities to be truly beyond measure, we have to feel each of them intensely, and without bias. That’s why Rinpoche always tells us to practice Equanimity first**.\n- The idea of starting all practices with self at the center and radiating out in progressively more inclusive circles until all of humanity and life immeasurable is included. The unloved self cannot radiate any further, and the familiar close ones are a safe and powerful place to practice before expanding further. With each expansion, we must practice equanimity of effect or love. This way each ring builds on a solid foundation starting with self. 👀❤️\n- **The acid test for any of the Near Enemies is to see if it causes us to be more, or less, empathetic with fellow sentient beings; does it join us or part us?**\n- **I’ve found that by tuning in to our common ground, I can practice any of the Four Boundless Qualities even with people I dislike the most, even people who have spent years waging campaigns against me**. But remember, these challenges are not for our first forays into these practices. Just as we push the envelope gradually when we do hamstring stretches, we push the envelope gently but consistently with these practices.\n- Scientific studies have shown that after a few weeks of daily practice, people’s capacity for loving connection, in various forms, improves dramatically. Stephen Post and Jill Neimark’s book Why Good Things Happen to *Good People* offers discussion and examples of this principle.\n1. Loving kindness\n- **Near Enemy**: Sentimentality\n- **Far Enemy**: Hatred, Ill Will\n- Sentimentality is shallow, surface emotional experiences instead of deeply contemplated, mindful, and intentional emotions\n- **Another Near Enemy of Loving Kindness is Conditional Love, a prevalent form of which—desire/clinging—is easily and often mistaken for true Love. The most popular arena for this little substitution is in romantic love**. Especially during the first three years of a relationship, huge loads of endorphins, the pleasure chemical in our brains, are produced. (Many “recreational drugs” artificially trigger them—making them hard to resist and hard to abandon.) Endorphins are the original high, and we can stimulate them naturally with new romantic love. Of course, we’d desire as much of that as we can get, and cling to every opportunity. But even without the brain science, you knew that. As soon as I mention desire/clinging being mistaken for love, I’m sure you can think of examples in your own life.\n- Important warning for practicing this method: I’d mentioned before that we Westerners might need to start with Loving Kindness for ourselves. This too, has a near enemy: self-centeredness.\n1. Compassion\n- **Near Enemy**: Pity\n- **Far Enemy**: Cruelty\n- Pity puts the recipient in a one-down position–by definition, breaching the goal of Equanimity\n- Death doulas - **Deep connection with another probably won’t heal the dying, but it certainly can help us in almost any circumstance**.\n1. Sympathetic Joy\n- **Near Enemy**: Hypocrisy\n- **Far Enemy**: Jealousy, **competitiveness**\n- **Even if you can’t celebrate those things for yourself, how will it hurt anything to celebrate it for them?**\n- **If we can be happy for some imaginary people getting such things in movies without resenting them for it, why not in real life?**\n- But even if we aren’t secretly jealous—the Far Enemy—we might, for example, be passing judgment secretly on their good fortune not being important, or their not being worthy of it.\n- **It always helps me to remember that the person experiencing joy—even if it’s not for reasons that would make me at all joyful—is wandering around in Samsara, just as confused as I am. They want to be happy as much as I do. They want to avoid suffering just as much too. If they’ve found a moment of joy in this bed of thorns, why not be happy for them? It doesn’t hurt me one bit to feel that joy.**\n- whenever I tune in to the underlying “we-ness” of our humanity, our sentient beingness, I feel a relaxing in my heart. I breathe easier—no doubt because I’ve just fallen into right relationship with that person. In this small way I’ve come closer to the way things truly are, closer to home.\n1. Equanimity\n- **Near Enemy**: Indifference\n- **Far Enemy**: Hatred\n- Hatred like all far enemies is always clear on the horizon but indifference stands beside you in a proud uniform of your own people making it more difficult to see\n- You can fall into Indifference and stay there for a long time, rather smug that you’re feeling Equanimity … but you’re not.\n- to expand our feeling of warm, caring connection to all beings, equally strong for every one of them\n- equanimity requires letting go of preference for those closest and being equally magnanimous and loving to all\n- equanimity is the strong love of all equally not the easier, equal indifference to all, or withdrawal. It is action; it is intentional and all-encompassing.\n- But beware, because Indifference can creep into your practice in all of the Four Boundless Qualities, not just with Compassion. That is exactly why the Buddha emphasized this distinction.\n",
      "hashtags": ["#buddhism", "#notes-and-contemplations"]
    }
  ],
  "changelog": [
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "created",
      "description": "Imported from Notion export - pre-website content"
    },
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "thought_added",
      "description": "Added Buddhist teaching notes",
      "thoughtId": "thought-buddhism-001"
    }
  ]
}
