{
  "title": "Chapter 6",
  "summary": "Buddhist practice notes and teachings - buddhism-books-guide-to-bodhisattva’s-way-of-life",
  "createdDate": "2025-12-11T18:28:30Z",
  "updatedDate": "2025-12-11T18:28:30Z",
  "hashtags": ["#buddhism", "#pre-website", "#buddhism-books-guide-to-bodhisattva’s-way-of-life"],
  "status": "active",
  "thoughts": [
    {
      "id": "thought-buddhism-001",
      "date": "2025-12-11T18:28:30Z",
      "content": "# Chapter 6\n\n# Relying on Patience\n\n- Anger is the ultimate harm\n- Patience is the ultimate salve\n- This can be achieved with effort\n- Disruptions in my routine are a source of anger for me. And the anger that is generated comes from me and not the event\n\n\n- Be happy regardless. There is little one can do that will change the world outsert it our heads\n- One step at a time. This is a progressive practice. Start small.\n\n\n- Anger is a guaranteed occurrence; only our reactions are in our control\n- Character defects arise from other sources and are not a cause in themselves\n- Everything we suffer from and take pleasure in is delusion. Therefore by controlling our minds we control our existence in samsara\n- Suffering is inevitable and is not the true desire of any being and thus anger towards others for the perception that they have caused me harm is foolishness\n\n\n- Jesusism: Hate the sin not the sinner verse 41\n\n\n- Retaliation is antithetical to bodhisattva practice  Verse 51\n- Happiness just as wealth does not stop the suffering of death for anyone\n- Attachments are like kindling for the fire of anger to spread\n- Joy can be found in a focus on the positive aspects of enemies\n\n\n- Remember to treat others with the actions and respect I would enjoy\n\n\n- I must love my enemies because they exist. Any harm I send their way in thought or deed does no true harm to them, only myself. Getting satisfaction from the misfortune of my enemies is the lowest mind to have.\n- Our reputations are but sandcastles before the tide\n\n\n- My enemies are the best source of enlightenment verses 99-111\n\n\n\n- The nonviolent path of Mandela, Gandhi, and Dr King, Jr is the way of the Buddha\n- Pleasing others is the way to enlightenment.\n\nNOTES ON CHAPTER:\n\n1. Anger is the mind killer.\n2. Patience is the PrEP for anger. \n3. I am aware that anger/patience is one of my most difficult personal battles\n4. They could be considered as opposing ideas on an Aristotelian virtue ethics golden mean slider. Except in Buddhism the virtue is the goal and not the moderation as in Aristotle’s view.\n5. Gotta learn to start with my tiny angers first and work up to my big mads \n6. In the long run, anger and revenge only hurt the person who wields them like in upside down sword 🗡 \n7. Loving my enemies is a great form of loving the teacher Buddha\n8. Non violent action must be my path. While not all people will make change with peace, a Buddhist will find a way. \n",
      "hashtags": ["#buddhism", "#buddhism-books-guide-to-bodhisattva’s-way-of-life"]
    }
  ],
  "changelog": [
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "created",
      "description": "Imported from Notion export - pre-website content"
    },
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "thought_added",
      "description": "Added Buddhist teaching notes",
      "thoughtId": "thought-buddhism-001"
    }
  ]
}
