{
  "title": "The Ten Non-Virtues from Buddhist Philosophy",
  "summary": "Buddhist practice notes and teachings - buddhism-books",
  "createdDate": "2025-12-11T18:28:30Z",
  "updatedDate": "2025-12-11T18:28:30Z",
  "hashtags": ["#buddhism", "#pre-website", "#buddhism-books"],
  "status": "active",
  "thoughts": [
    {
      "id": "thought-buddhism-001",
      "date": "2025-12-11T18:28:30Z",
      "content": "# The Ten Non-Virtues from Buddhist Philosophy\n\n[The Ten Non-Virtues from Buddhist Doctrine](https://kamaltouhid.medium.com/the-ten-non-virtues-from-buddhist-doctrine-e96dd82d1f3f)\n\n# Results of Doing the Ten Non-Virtues\n\n1. Killing any living being. It includes abortion, suicide (ruining a body that could have reached nirvana in this life), and participating in the military (even being a cook, it is as if you shot the gun yourself).\n    1. Personal Result: Your life is short; and you get sick easily, have little energy.\n    2. Environmental Result: Food, drink, medicine, crops, have very little effect, are always inferior, are not nutritious, are hard to digest, and cause disease in you. Most beings around you die before reaching the end of a full life.\n2. Stealing anything of value: includes shady business deals, cheating on rent, taxes, or bills, underpaying what is due to local government or society, etc.\n    1. Personal Result: You do not have enough to live on or to make ends meet; and what you do have is all just common property with others.\n    2. Environmental Result: The crops are few and far between, they have no power to remove hunger, they spoil or never come up; dry spells stay on too long; it rains too much; the crops dry up or die off\n3. Sexual Misconduct. It mainly means adultery — cheating on your partner, a person to whom you are exclusively committed. It also includes some specific secondary behaviors.\n    1. Personal Result: The people who work around you are “inconsistent” (unreliable); and you find yourself having a lot of competition for your partner.\n    2. Environmental Result: You live in a place where there is urine and feces all around, and mud, dirt, filth; everything stinks and everywhere seems unpleasant and distasteful.\n4. Lying, giving someone else a wrong impression about what you have seen, believe, or know; unless it would save someone’s life or prevent real suffering. If you lie and get something, the benefit comes from past good deeds, not from the lie.\n    1. Personal Result: No one believes what you say; even when you are speaking the truth, others are always deceiving you.\n    2. Environmental Result: Your work in cooperation with others fails to prosper and people around you do not work well together; everyone generally is cheating one another and is afraid, and there are many things to be afraid of.\n5. Divisive Talk, splitting people up with your talk; saying things to alienate or separate two different people, (regardless of whether or not your words are true); causing one person to like another person less; it is usually subtle, like in your tone of voice.\n    1. Personal Result: You lose friends easily; people around you are always fighting one another; and people around you have an undesirable character.\n    2. Environmental Result: The ground you live in is split up, uneven, covered with crags and gullies, highs and lows, so travel is difficult and you are always afraid and there are many things to be afraid of.\n6. Harsh Talk, with bad intent and effect; it includes sarcastic “nice” words and swearing.\n    1. Personal Result: You hear many unpleasant things, you hear things as bad sounds; and when others talk to you it always seems to you as if they want to start a fight.\n    2. Environmental Result: The ground where you live is covered with obstacles like fallen tree trunks, thorns, stones, sharp broken glass; it is rough, dreary, no streams or water springs; the ground is parched and poisoned, burning hot and threatening; there are many things to fear.\n7. Idle Talk, meaningless chatter, criticism, disputes, useless joking, whining, complaining, speaking out of the motive of attachment or craving; gossiping about politics, sports, etc., or about people engaged in wrong livelihood; reciting prayers while not thinking about their meaning. Gossiping about others’ values or spiritual practice. Dharma is sacred and should be discussed in holy private whispers on special nights, not casually — talk in hushed tones, very beautiful sacred speech, talk about inspiring things. As an aspiring bodhisattva, you may need to discuss mundane topics with others for their benefit, but keep the ultimate goal in mind, and do not be drawn into worldly conversations.\n    1. Personal Result: No one listens to you; no one respects what you say — no one thinks that what you say has any particular value; and you are afflicted with a lack of confidence and self-esteem.\n    2. Environmental Result:Fruits refuse to grow, or grow at the wrong times, seem ripe when they are not, have frail roots; there are no leisure places around like parks, or pools of cool water; many things around make you afraid.\n8. Craving/Coveting, is similar to coveting in the Ten Commandments. Wanting others’ possessions and personal qualities like their intelligence, health, fame, youth, or spiritual achievements. It comes in five stages: you are attached to your own possessions, desire to accumulate more than you have, discover another’s possessions, like to make them your own, and the desire becomes unmanageable and you “lose shame” (then you act).\n    1. Personal Result: Your personality is dominated by desire; and you are never satisfied with what you have.\n    2. Environmental Result: Every good thing you manage to find starts to get worse, decrease as days, months, and seasons pass.\n9. Ill-Will, is to wish bad things upon others; being pleased when others fail or have misfortune; competitiveness, like “Oh, how did they mess up? Tell me more…” not feeling as bad for an unfortunate person as you would feel for yourself if you were them.\n    1. Personal Result: Your personality is dominated by anger; you are always finding yourself without help, or never find the help you need; and you are always hurting others, or always being hurt by others.\n    2. Environmental Result: You live in a world of chaos, diseases spread, evil is everywhere, plague, conflict, fear of harm from the military, dangerous animals, you are surrounded by harmful spirits, thieves or muggers, etc.\n10. Wrong View, “Incorrect world view” means not regarding karma as being the direct cause of every microsecond of experience we have. This leads to doing misdeeds #1–9\n    1. Personal Result: Your personality is dominated by stupidity; you are a person who keeps harmful views; and you are a deceitful person.\n    2. Environmental Result: You live in a world where the single highest source of happiness is steadily disappearing from the earth; where people think that unclean and suffering things are actually nice and happy; where there is no place to go, no one to help you, nothing to protect you.\n",
      "hashtags": ["#buddhism", "#buddhism-books"]
    }
  ],
  "changelog": [
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "created",
      "description": "Imported from Notion export - pre-website content"
    },
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "thought_added",
      "description": "Added Buddhist teaching notes",
      "thoughtId": "thought-buddhism-001"
    }
  ]
}
