{
  "title": "II. Teaching of the Eight Verses for Teaching the Mind",
  "summary": "Buddhist practice notes and teachings - buddhism-books-intro-to-buddhism---dalai-lama",
  "createdDate": "2025-12-11T18:28:30Z",
  "updatedDate": "2025-12-11T18:28:30Z",
  "hashtags": ["#buddhism", "#pre-website", "#buddhism-books-intro-to-buddhism---dalai-lama"],
  "status": "active",
  "thoughts": [
    {
      "id": "thought-buddhism-001",
      "date": "2025-12-11T18:28:30Z",
      "content": "# II. Teaching of the Eight Verses for Teaching the Mind\n\n- Every individual has an individualized spiritual path and it would not be appropriate to judge them for it\n- Pali and Sanskrit language canons of Buddhism\n- Nalanda monastic tradition\n    - Insight into the nature of reality\n    - “Skillful means” - development of intentional compassion for the benefit of all humans and all life\n    - These practices lead to a renunciation of samsara\n\n## Cultivating wisdom, and skillful means\n\n- Conventional Bodhichitta\n- Ultimate Bodhichitta\n- The ultimate aim of a Buddhist practitioner is the attain Buddhahood, which is an embodiment of the two perfections Buddhist body of truth, Dharmakaya and form body rupakaya\n- The dharmakaya is his wisdom mind\n- The rupakaya is a transforming body that allows him to take different forms in order to benefit all sentient beings - through altruism\n- Cultivating our understanding, emptiness as a tremendous power to enhance our natural empathetic, feeling towards others, fellow sentient beings, and thus gives rise to a stronger compassion - [an empty vessel is easier to fill with others rather than oneself]\n- Conversely, compassion can expedite our accumulation of merit, which makes it easier for us to deepen our understanding of emptiness\n- In this way, one practice powers the other - “two wings of the same bird”\n- When we speak of getting higher levels of realization and Buddhism, we are speaking, primarily to the process, through which our wisdom inside deepens\n- Five levels of the path\n    - The path of accumulation\n    - The path of preparation\n    - The path of insight\n    - The path of meditation\n    - The path of no more learning\n    - Attainment of the these levels of the path as explained in the condensed form of the heart Sutra\n\n\n\n- From Nagarjuna’s Fundamentals of the Middle Way\n- According to this text, a true understanding of emptiness is based on an understanding of dependent origination\n- In other words, dependent origination must be understood as the very ground upon which emptiness arises\n    - Two interpretations of this ideology: Bhavaviveka and Buddhapalita\n    - Buddhapalita\n        - This interpretation explains that when we analyze things and events, particularly the world of cause-and-effect, and the plurality of our every day experience, we are relating to the world at the conventional level of reality, if we are unsatisfied with that level of every day reality, however, and we go beyond it to critically inquire into the exact nature of the relationship of the causes, and affects, analyzing whether they are identical or independent of each other, and so on, we are relating to the world at the level of ultimate truth.\n        - It explains that when we critically subject cause-and-effect to that kind of penetrative questioning, we soon come to the conclusion that they are unfindable\n        - Therefore, when we engage with the world, we have to do so, at the level of conventional truth for every day wisdom\n        - Chandrakirti explains that a genuine understanding of emptiness, entails a  deep appreciation of the interdependent nature of reality - that all things and events coming to being as a result of dependence on other factors\n\n## Making a new spiritual resolve ✅✅✅✅✅\n\n- “If I continue to be guided by my own self-centeredness, and my single-pointed concern for my own well-being, continue to ignore the well-being of others, what will the consequences be?“\n\n“From beginningless lifetimes, I have harbor this self cherishing attitude, and have grasp onto the notion of an intrinsically real, enduring self. I have nurtured these two thoughts of self cherishing and self grasping deep in my heart, as if they were twins gems. But where has this way of being led me? By pursuing the dictates of my self grasping in self-centeredness have I actually managed to attain the fulfillment of myself interest? If it were possible, surely by now I should have achieved my goal. But I know this is not the case.”\n\n- “How did the Buddha accomplish this?“\n\n\n- From the Buddhist point of you, even being born in the higher grounds, depends upon interaction with other sentient beings\n- The key factor for such an achievement is the observance of the ethical discipline of refraining from 10 negative actions of body speech and mind\n- Three Higher Trainings\n    1. Morality - what is wrong?\n    2. Meditation - what did you do that is wrong?\n    3. Wisdom  -  how can you not do that again?\n- For practitioners Bodhichitta, the altruistic intention, who are known as the bodhisattva is necessary to first cultivate compassion and love and kindness towards all sentient beings\n    - Compassion is the wish that all sentient beings be free from suffering\n    - Loving kindness is a state of mind which aspires that all sentient being enjoy happiness\n- Original Indian philosophical explorations focused a lot of time on the “self” and the concept of “I” but Buddhism has evolve in such a way that this very “self” in the central stumbling block to enlightenment\n- Further study by philosophical scholars determined that there is a sentience that is separate from the physical mind and body that is eternal\n- As a general rule, Buddhist schools of thought reject any notion of “self” as an internal principal existing independently of the body and mind\n- There are divergences of opinion among the various Buddha schools, as to the true identity of the “self“\n\n\n- In some Buddhist philosophies, The real referent of the self or “I” is the continuum of conscious that flows through all eternity\n- To those in the Chandrakirti camp, all existence is a construct or label to a pile of causes and conditions. Thus, it is not an independent entity in and of itself.\n- We study these esoteric philosophy treatises because delusion undergirds all emotional and mental states. Only by undercutting these delusions can we hope to overcome our current confusion\n\n\n- It is grasping at self and world that leads to suffering and we must find a way to cease doing so\n\n# Verse 2\n\n\n- Approach this practice with supplication\n- Being humble in Buddhism at times may take the form of actual servitude\n- Standing firm and strong in one’s beliefs is also required.\n- A Buddha is both a parent and a child\n\n# Verse 3\n\n\n- one must confront one’s own mental afflictions\n- We must tame the mind with equanimity. Only then can we lead others to the path.\n- We use loving kindness to defuse anger and hatred\n- We observe our own thoughts and counteract the negative with positive processes\n- The above are the temporary solutions while developing insight into the nature of reality is the cure of these maladies\n\n# Verse 4\n\n\n- Finding a person in a bad way who also has a bad attitude is not “someone who deserves their fate” but a unique opportunity to hone your skill set in compassion and empathy with a particularly difficult person and should be treasured as such\n\n# Verse 5\n\n\n- One who choose the path of Bodhichitta must way options wisely and not act out of emotion\n- We must exchange the pain of others for the joy the path has brought us\n- Shantideva says:\n\n\n# Verse 6\n\n\n- we should see them as a way practice forbearance and loving kindness in a difficult new way. Hardest lessons bear sweetest fruit like in that meditation at Recovery Dharma. And the difficult parts are the nourishing sun\n\n# Verse 7\n\n\n- this is known as the practice of tonglen which literally means “giving and taking”\n- We often undertake spiritual activities for selfish reasons\n- We must learn to have an intention only to cherish the well-being of others and match that with an altruistic action\n- 7 points for training of the mind says to “take the two astride one’s breath” meaning to give and take with each breath\n- Taking - take in all the suffering in the world with your inhale\n- Giving - give back all the positive things in your life both material and spiritual to the rest of the world\n- Tonglen in this form trains the mind to convert the world’s suffering into the world’s benefit all through your actions and as a side effect you benefit in the world as well.\n- Bodhichitta is the altruistic mind of awakening, the aspiration tonattain Buddhahood for the benefit of all sentient beings\n- This aspiration arises from two other aspirations\n1. The actual aspiration to attain enlightenment \n    1. Enlightenment means the liberation from cyclic existence- repeating the same mistakes over and over hoping for different results?\n    2. An understanding of emptiness \n2. The aspiration to bring about the welfare of all sentient beings\n- Achievement of Bodhichitta and our depth of achievement depends on our\n- This compassion in not just intention to be compassionate but a deep abiding sense of responsibility for actions that generate  and distribute compassion. It is thought AND behavior.\n- To attain this compassion we must train our mind in two othe factors\n1. empathy with or closeness to those we wish to relieve their suffering\n    1. Seven point cause and effect method\n    2. Method of exchanging and equalizing of self and other\n        1. Eight verses on training the mind\n2. A deep insight into the nature of the suffering we wish to relieve\n    1. Train in relation to our own experience of suffering first\n        1. Reflect on the four noble truths especially suffering and its causes\n        2. Three types of suffering\n            1. Suffering of suffering \n                1. \n                \n                [The Ten Non-Virtues from Buddhist Doctrine](https://kamaltouhid.medium.com/the-ten-non-virtues-from-buddhist-doctrine-e96dd82d1f3f)\n                \n            2. Suffering of change\n            3. Suffering of pervasive conditioning\n            4. \n- \n\n# Verse 8\n\n\n- the ultimate Bodhichitta is defiled by the “eight mundane concerns\n- Space meditation vs illusion meditation\n\nGrasping at “self” takes two primary forms:\n\n1. Grasping at “self-existence of persons”\n2. Grasping at “self-existence of phenomena”\n\n## Generating the Altruistic Mind of Awakening: a ceremony\n\nThe seven Limb Practices\n\n1. Prostrations\n2. Making offerings \n3. Confession and purification of non virtuous actions\n4. Cultivating the capacity to rejoice in the positive actions of others\n5. Appealing to the Buddhas to turn the Wheel of Dharma\n6. Requesting the Buddhas not to enter Nirvana \n7. Dedication\n\nIn the space of the Buddha painting, imagine a real Buddha is present. Imagine that the Buddha is surrounded by many great spiritual Masters of the past. With a mind free of afflictive emotion,  \n\n- reflect upon the fact that all sentient beings have a desire to be free from pain and suffering\n- Reflect upon the disadvantages of self-cherishing and self-centeredness\n- Reflect upon the benefits of helping others and selflessness and benefiting their wellbeing\n- Bring to mind the infinite sentient beings and cultivate the strong determination that you will seek the attainment of full Buddhahood so you can accomplish their welfare\n\nRecite the prayer in this contemplative state:\n",
      "hashtags": ["#buddhism", "#buddhism-books-intro-to-buddhism---dalai-lama"]
    }
  ],
  "changelog": [
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "created",
      "description": "Imported from Notion export - pre-website content"
    },
    {
      "date": "2025-12-11T18:28:30Z",
      "action": "thought_added",
      "description": "Added Buddhist teaching notes",
      "thoughtId": "thought-buddhism-001"
    }
  ]
}
